/**
  ******************************************************************************
  * @file    usbd_video.c
  * @author  MCD Application Team
  * @version V2.4.2
  * @date    11-December-2015
  * @brief   This file provides the Audio core functions.
  *
  * @verbatim
  *      
  *          
  * @note     In HS mode and when the DMA is used, all variables and data structures
  *           dealing with the DMA during the transaction process should be 32-bit aligned.
  *           
  *      
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2015 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 

/* Includes ------------------------------------------------------------------*/
#include "usbd_video.h"

    0x09, 0x01,                    //   USAGE (Pointer)
    0x15, 0x00,                    //   LOGICAL_MINIMUM (0)
    0x26, 0xff, 0x00,              //   LOGICAL_MAXIMUM (255)
    0x75, 0x08,                    //   REPORT_SIZE (8)
    0x95, CONTROL_PACKET_SIZE,                    //   REPORT_COUNT (CONTROL_PACKET_SIZE)
    0x91, 0x02,                    //   OUTPUT (Data,Var,Abs)
    0xc0,                          // END_COLLECTION
  }; /* Keyboard_ReportDescriptor */
  
/**
  * @}
  */ 

/** @defgroup USBD_VIDEO_Private_Functions
  * @{
  */ 
// static allocate memory
USBD_VIDEO_HandleTypeDef video_class_handle;
  
/**
  * @brief  USBD_VIDEO_Init
  *         Initialize the VIDEO interface
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t  USBD_VIDEO_Init (USBD_HandleTypeDef *pdev, 
                               uint8_t cfgidx)
{
  USBD_VIDEO_HandleTypeDef   *hvideo;
  USB_OTG_GlobalTypeDef *USBx = USB_OTG_FS;
  
  /* Open EP OUT */
  USBD_LL_OpenEP(pdev,
                 VIDEO_IN_EP,
                 VIDEO_EP_TYPE,
                 VIDEO_PACKET_SIZE);
  
  USBD_LL_OpenEP(pdev,
                 CONTROL_OUT_EP,
                 USBD_EP_TYPE_INTR,
                 CONTROL_PACKET_SIZE);
  
  /* Allocate Video structure */
  pdev->pClassData = &video_class_handle;//USBD_malloc(sizeof (USBD_VIDEO_HandleTypeDef));
  
  if(pdev->pClassData == NULL)
  {
    return USBD_FAIL; 
  }
  else
  {
    hvideo = (USBD_VIDEO_HandleTypeDef*) pdev->pClassData;
    hvideo->alt_setting = 0;
    hvideo->offset = VIDEO_OFFSET_UNKNOWN;
    hvideo->wr_ptr = 0; 
    hvideo->rd_ptr = 0;  
    hvideo->rd_enable = 0;
    // payload header, must toggle every frame
    hvideo->video_interface_changed = 0;
    hvideo->video_alt_setting = 0;
    hvideo->current_length = 0;
    hvideo->total_length = 0;
    hvideo->video_frame_id = 0x00;
    
    /* Initialize the Audio output Hardware layer */
    if (((USBD_VIDEO_ItfTypeDef *)pdev->pUserData)->Init(USBD_VIDEO_FREQ, VIDEO_DEFAULT_VOLUME, 0) != USBD_OK)
    {
      return USBD_FAIL;
    }
    
    /* Prepare Out endpoint to receive control packet */ 
    USBD_LL_PrepareReceive(pdev,
                           CONTROL_OUT_EP,
                           hvideo->control_buffer,
                           CONTROL_PACKET_SIZE);
  }
  return USBD_OK;
}

/**
  * @brief  USBD_VIDEO_Init
  *         DeInitialize the VIDEO layer
  * @param  pdev: device instance
  * @param  cfgidx: Configuration index
  * @retval status
  */
static uint8_t  USBD_VIDEO_DeInit (USBD_HandleTypeDef *pdev, 
                                 uint8_t cfgidx)
{
  
  /* Open EP OUT */
  USBD_LL_CloseEP(pdev,
              VIDEO_IN_EP);
  USBD_LL_CloseEP(pdev,
              CONTROL_OUT_EP);

  /* DeInit  physical Interface components */
  if(pdev->pClassData != NULL)
  {
   ((USBD_VIDEO_ItfTypeDef *)pdev->pUserData)->DeInit(0);
    //USBD_free(pdev->pClassData);
    pdev->pClassData = NULL;
  }
  
  return USBD_OK;
}

uint32_t MUTE_DATA = 0;


typedef struct  _VideoControl{
  uint8_t    bmHint[2];                      // 0x02
  uint8_t    bFormatIndex[1];                // 0x03
  uint8_t    bFrameIndex[1];                 // 0x04
  uint8_t    dwFrameInterval[4];             // 0x08
  uint8_t    wKeyFrameRate[2];               // 0x0A
  uint8_t    wPFrameRate[2];                 // 0x0C
  uint8_t    wCompQuality[2];                // 0x0E
  uint8_t    wCompWindowSize[2];             // 0x10
  uint8_t    wDelay[2];                      // 0x12
  uint8_t    dwMaxVideoFrameSize[4];         // 0x16
  uint8_t    dwMaxPayloadTransferSize[4];    // 0x1A
  uint8_t    dwClockFrequency[4];            // 0x1C
  uint8_t    bmFramingInfo[1];
  uint8_t    bPreferedVersion[1];
  uint8_t    bMinVersion[1];
  uint8_t    bMaxVersion[1];
  
}VideoControl;

VideoControl    videoCommitControl = 
{
  {0x01,0x00},                      // bmHint
  {0x01},                           // bFormatIndex
  {0x01},                           // bFrameIndex
  {MAKE_DWORD(INTERVEL),},          // dwFrameInterval
  {0x00,0x00,},                     // wKeyFrameRate
  {0x00,0x00,},                     // wPFrameRate
  {0x00,0x00,},                     // wCompQuality
  {0x00,0x00,},                     // wCompWindowSize
  {0x00,0x00},                      // wDelay
  {MAKE_DWORD(MAX_FRAME_SIZE)},    // dwMaxVideoFrameSize
  {0x00, 0x00, 0x00, 0x00},         // dwMaxPayloadTransferSize
  {0x00, 0x00, 0x00, 0x00},         // dwClockFrequency
  {0x00},                           // bmFramingInfo
  {0x00},                           // bPreferedVersion
